openfoam/shape_optimization/clean/baseCase_1/system/blockMeshDict
/*--------------------------------*Thien  Phan*-------------------------------*\                  
|  =========                                  |                                                                                                  |                  
|  \\            /    F  ield                  |  OpenFOAM:  phanquocthien.org                                          |                
|    \\        /      O  peration          |  Files  are  generated  by  Thien  Phan                              |                  
|      \\    /        A  nd                      |  Web:            www.OpenFOAM.com                                            |                
|        \\/          M  anipulation    |                  PhanQuocThien@gmail.com                                  |                  
\*---------------------------------------------------------------------------*/                  
FoamFile                
{                
        version          2.0;                
        format            ascii;                
        class              dictionary;                
        object            blockMeshDict;                
}                
//  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  *  //                
convertToMeters 1 ;              
                
geometry                
{                
}                
                
vertices                
(                
 ( 0 0 0 ) // 0         
 ( 1 0 0 ) // 1         
 ( 1 12 0 ) // 2         
 ( -11 0 0 ) // 3         
 ( 0 0 0.3 ) // 4         
 ( 1 0 0.3 ) // 5         
 ( 1 12 0.3 ) // 6         
 ( -11 0 0.3 ) // 7         
 ( 21 1.83027059770082 0 ) // 8         
 ( 21 12 0 ) // 9         
 ( 21 1.83027059770082 0.3 ) // 10         
 ( 21 12 0.3 ) // 11         
 ( 1 -12 0 ) // 12         
 ( 1 -12 0.3 ) // 13         
 ( 21 -12 0 ) // 14         
 ( 21 -12 0.3 ) // 15         
 ( 1 0 0 ) // 16         
 ( 1 0 0.3 ) // 17         
                
);                
                
                
blocks                
(                
 hex (0 1 2 3 4 5 6 7) ( 41 48 1 ) //block 1.0
 edgeGrading               
 (               
 // x-direction expansion ratio            
 (               
( 0.4 0.51219512195122 3.5 )            
( 0.6 0.487804878048781 0.857142857142857 )            
 )               
 0.03 0.03              
 (               
( 0.4 0.51219512195122 3.5 )            
( 0.6 0.487804878048781 0.857142857142857 )            
 )               
 // y-direction expansion ratio            
 (               
( 0.0416666666666667 0.354166666666667 22.1861110674044 )            
( 0.958333333333333 0.645833333333333 9.0146488220659 )            
 )               
 (               
( 0.0416666666666667 0.354166666666667 22.1861110674044 )            
( 0.958333333333333 0.645833333333333 9.0146488220659 )            
 )               
 (               
( 0.0416666666666667 0.354166666666667 22.1861110674044 )            
( 0.958333333333333 0.645833333333333 9.0146488220659 )            
 )               
 (               
( 0.0416666666666667 0.354166666666667 22.1861110674044 )            
( 0.958333333333333 0.645833333333333 9.0146488220659 )            
 )               
                
 // z-direction expansion ratio            
 1 1 1 1            
 )               
                
 hex (1 8 9 2 5 10 11 6) ( 74 48 1) //block 2 
 edgeGrading               
 (               
 // x-direction expansion ratio            
 33.3333333333333 33.3333333333333 33.3333333333333 33.3333333333333            
 // y-direction expansion ratio            
 (               
( 0.0416666666666667 0.354166666666667 22.1861110674044 )            
( 0.958333333333333 0.645833333333333 9.0146488220659 )            
 )               
 13.9581659180375 13.9581659180375              
 (               
( 0.0416666666666667 0.354166666666667 22.1861110674044 )            
( 0.958333333333333 0.645833333333333 9.0146488220659 )            
 )               
                
 // z-direction expansion ratio            
 1 1 1 1            
 )               
                
 hex (3 12 16 0 7 13 17 4) ( 41 48 1 ) //block 3.0
 edgeGrading               
 (               
 // x-direction expansion ratio            
 0.03               
 (               
( 0.4 0.51219512195122 3.5 )            
( 0.6 0.487804878048781 0.857142857142857 )            
 )               
 (               
( 0.4 0.51219512195122 3.5 )            
( 0.6 0.487804878048781 0.857142857142857 )            
 )               
 0.03               
 // y-direction expansion ratio            
 (               
( 0.958333333333333 0.645833333333333 0.110930555337022 )            
( 0.0416666666666667 0.354166666666667 0.0450732441103295 )            
 )               
 (               
( 0.958333333333333 0.645833333333333 0.110930555337022 )            
( 0.0416666666666667 0.354166666666667 0.0450732441103295 )            
 )               
 (               
( 0.958333333333333 0.645833333333333 0.110930555337022 )            
( 0.0416666666666667 0.354166666666667 0.0450732441103295 )            
 )               
 (               
( 0.958333333333333 0.645833333333333 0.110930555337022 )            
( 0.0416666666666667 0.354166666666667 0.0450732441103295 )            
 )               
                
 // z-direction expansion ratio            
 1 1 1 1            
 )               
                
                
                
                
                
 hex (12 14 8 16 13 15 10 17) ( 74 48 1) //block 4 
 edgeGrading               
 (               
 // x-direction expansion ratio            
 33.3333333333333 33.3333333333333 33.3333333333333 33.3333333333333            
 // y-direction expansion ratio            
 (               
( 0.958333333333333 0.645833333333333 0.110930555337022 )            
( 0.0416666666666667 0.354166666666667 0.0450732441103295 )            
 )               
 0.0716426503218266 0.0716426503218266              
 (               
( 0.958333333333333 0.645833333333333 0.110930555337022 )            
( 0.0416666666666667 0.354166666666667 0.0450732441103295 )            
 )               
                
 // z-direction expansion ratio            
 1 1 1 1            
 )               
);                
                
                
edges                
(                
 arc 3  2 ( -7.48528137423857 8.48528137423857 0 )         
 arc 7  6   ( -7.48528137423857 8.48528137423857 0.3 )         
                
 spline 1 0             
 (               
 ( 0.999013364214136 0.0015812837052528 0 )           
 ( 0.996057350657239 0.00191458565012632 0 )           
 ( 0.991143625364344 0.00246825999530805 0 )           
 ( 0.984291580564316 0.00323956922778629 0 )           
 ( 0.975528258147577 0.00422469240008573 0 )           
 ( 0.964888242944125 0.00541873648234154 0 )           
 ( 0.95241352623301 0.0068157506350912 0 )           
 ( 0.938153340021932 0.0084087431414747 0 )           
 ( 0.922163962751008 0.0101897006555448 0 )           
 ( 0.904508497187474 0.0121496093231295 0 )           
 ( 0.885256621387894 0.0142784772054077 0 )           
 ( 0.864484313710706 0.0165653572720233 0 )           
 ( 0.842273552964344 0.0189983700139295 0 )           
 ( 0.818711994874345 0.0215647244320876 0 )           
 ( 0.793892626146236 0.0242507357498912 0 )           
 ( 0.767913397489498 0.0270418376177731 0 )           
 ( 0.740876837050858 0.0299225857375913 0 )           
 ( 0.712889645782536 0.0328766485854438 0 )           
 ( 0.684062276342339 0.0358867790102518 0 )           
 ( 0.654508497187474 0.0389347575122453 0 )           
 ( 0.624344943582427 0.0420012932159264 0 )           
 ( 0.593690657292862 0.0450658605737068 0 )           
 ( 0.562666616782152 0.0481064360268101 0 )           
 ( 0.531395259764657 0.0510990738578988 0 )           
 ( 0.5 0.0540128911703342 0 )           
 ( 0.468604740235343 0.0567240530470201 0 )           
 ( 0.437333383217848 0.0591601925102539 0 )           
 ( 0.406309342707138 0.0612861407474555 0 )           
 ( 0.375655056417573 0.063066664018029 0 )           
 ( 0.345491502812526 0.0644664526231708 0 )           
 ( 0.315937723657661 0.065450051871657 0 )           
 ( 0.287110354217464 0.065981709590852 0 )           
 ( 0.259123162949142 0.0660251010227142 0 )           
 ( 0.232086602510502 0.0655428689110962 0 )           
 ( 0.206107373853763 0.0645119903415857 0 )           
 ( 0.181288005125655 0.0630497223398599 0 )           
 ( 0.157726447035656 0.0611719605897525 0 )           
 ( 0.135515686289294 0.0588582567200875 0 )           
 ( 0.114743378612105 0.0560870611140189 0 )           
 ( 0.0954915028125263 0.0528344637184642 0 )           
 ( 0.0778360372489925 0.0490719174628721 0 )           
 ( 0.0618466599780682 0.0447618870365413 0 )           
 ( 0.0475864737669902 0.0398722344411238 0 )           
 ( 0.0351117570558743 0.0346939089856351 0 )           
 ( 0.0244717418524232 0.0293372434593177 0 )           
 ( 0.0157084194356845 0.023805096731499 0 )           
 ( 0.00885637463565564 0.0181009290165541 0 )           
 ( 0.00394264934276106 0.0122288063495999 0 )           
 ( 0.00098663578586422 0.00619340274339926 0 )           
 )               
                
                
 spline 5 4             
 (               
 ( 0.999013364214136 0.0015812837052528 0.3 )           
 ( 0.996057350657239 0.00191458565012632 0.3 )           
 ( 0.991143625364344 0.00246825999530805 0.3 )           
 ( 0.984291580564316 0.00323956922778629 0.3 )           
 ( 0.975528258147577 0.00422469240008573 0.3 )           
 ( 0.964888242944125 0.00541873648234154 0.3 )           
 ( 0.95241352623301 0.0068157506350912 0.3 )           
 ( 0.938153340021932 0.0084087431414747 0.3 )           
 ( 0.922163962751008 0.0101897006555448 0.3 )           
 ( 0.904508497187474 0.0121496093231295 0.3 )           
 ( 0.885256621387894 0.0142784772054077 0.3 )           
 ( 0.864484313710706 0.0165653572720233 0.3 )           
 ( 0.842273552964344 0.0189983700139295 0.3 )           
 ( 0.818711994874345 0.0215647244320876 0.3 )           
 ( 0.793892626146236 0.0242507357498912 0.3 )           
 ( 0.767913397489498 0.0270418376177731 0.3 )           
 ( 0.740876837050858 0.0299225857375913 0.3 )           
 ( 0.712889645782536 0.0328766485854438 0.3 )           
 ( 0.684062276342339 0.0358867790102518 0.3 )           
 ( 0.654508497187474 0.0389347575122453 0.3 )           
 ( 0.624344943582427 0.0420012932159264 0.3 )           
 ( 0.593690657292862 0.0450658605737068 0.3 )           
 ( 0.562666616782152 0.0481064360268101 0.3 )           
 ( 0.531395259764657 0.0510990738578988 0.3 )           
 ( 0.5 0.0540128911703342 0.3 )           
 ( 0.468604740235343 0.0567240530470201 0.3 )           
 ( 0.437333383217848 0.0591601925102539 0.3 )           
 ( 0.406309342707138 0.0612861407474555 0.3 )           
 ( 0.375655056417573 0.063066664018029 0.3 )           
 ( 0.345491502812526 0.0644664526231708 0.3 )           
 ( 0.315937723657661 0.065450051871657 0.3 )           
 ( 0.287110354217464 0.065981709590852 0.3 )           
 ( 0.259123162949142 0.0660251010227142 0.3 )           
 ( 0.232086602510502 0.0655428689110962 0.3 )           
 ( 0.206107373853763 0.0645119903415857 0.3 )           
 ( 0.181288005125655 0.0630497223398599 0.3 )           
 ( 0.157726447035656 0.0611719605897525 0.3 )           
 ( 0.135515686289294 0.0588582567200875 0.3 )           
 ( 0.114743378612105 0.0560870611140189 0.3 )           
 ( 0.0954915028125263 0.0528344637184642 0.3 )           
 ( 0.0778360372489925 0.0490719174628721 0.3 )           
 ( 0.0618466599780682 0.0447618870365413 0.3 )           
 ( 0.0475864737669902 0.0398722344411238 0.3 )           
 ( 0.0351117570558743 0.0346939089856351 0.3 )           
 ( 0.0244717418524232 0.0293372434593177 0.3 )           
 ( 0.0157084194356845 0.023805096731499 0.3 )           
 ( 0.00885637463565564 0.0181009290165541 0.3 )           
 ( 0.00394264934276106 0.0122288063495999 0.3 )           
 ( 0.00098663578586422 0.00619340274339926 0.3 )           
 )               
                
                
 arc 3  12 ( -7.48528137423857 -8.48528137423857 0 )         
 arc 7  13 ( -7.48528137423857 -8.48528137423857 0.3 )         
                
 spline 0 16             
 (               
 ( 0.00098663578586422 -0.00635809753497436 0 )           
 ( 0.00394264934276106 -0.0122590110626939 0 )           
 ( 0.00885637463565564 -0.0176989192334467 0 )           
 ( 0.0157084194356845 -0.0226757816331919 0 )           
 ( 0.0244717418524232 -0.0271893276626386 0 )           
 ( 0.0351117570558743 -0.0312410384885343 0 )           
 ( 0.0475864737669902 -0.0348342808580086 0 )           
 ( 0.0618466599780682 -0.0380615624096596 0 )           
 ( 0.0778360372489925 -0.0410062925925821 0 )           
 ( 0.0954915028125263 -0.0436778517447541 0 )           
 ( 0.114743378612105 -0.046084227004278 0 )           
 ( 0.135515686289294 -0.0482329579663647 0 )           
 ( 0.157726447035656 -0.0501316165159494 0 )           
 ( 0.181288005125655 -0.0517880584953408 0 )           
 ( 0.206107373853763 -0.0531309195162837 0 )           
 ( 0.232086602510502 -0.0539891531778003 0 )           
 ( 0.259123162949142 -0.0544856203234725 0 )           
 ( 0.287110354217464 -0.0547030814940166 0 )           
 ( 0.315937723657661 -0.0546936280041581 0 )           
 ( 0.345491502812526 -0.0544937153484667 0 )           
 ( 0.375655056417573 -0.054130968298588 0 )           
 ( 0.406309342707138 -0.0536276477640792 0 )           
 ( 0.437333383217848 -0.0530025701951406 0 )           
 ( 0.468604740235343 -0.0522722366456904 0 )           
 ( 0.5 -0.0514515271670859 0 )           
 ( 0.531395259764657 -0.0505541417462108 0 )           
 ( 0.562666616782152 -0.0495356239606517 0 )           
 ( 0.593690657292862 -0.048262048242063 0 )           
 ( 0.624344943582427 -0.0467309001190756 0 )           
 ( 0.654508497187474 -0.0449502589402877 0 )           
 ( 0.684062276342339 -0.042932612032445 0 )           
 ( 0.712889645782536 -0.0406949176004744 0 )           
 ( 0.740876837050858 -0.0382585923711643 0 )           
 ( 0.767913397489498 -0.0356494146301443 0 )           
 ( 0.793892626146236 -0.0328973339264809 0 )           
 ( 0.818711994874345 -0.0300361798913442 0 )           
 ( 0.842273552964344 -0.0271032644405466 0 )           
 ( 0.864484313710706 -0.0241388741908958 0 )           
 ( 0.885256621387894 -0.0211856532674638 0 )           
 ( 0.904508497187474 -0.0182878808085349 0 )           
 ( 0.922163962751008 -0.0154906523075569 0 )           
 ( 0.938153340021932 -0.0128389792950405 0 )           
 ( 0.95241352623301 -0.010376827483157 0 )           
 ( 0.964888242944125 -0.00814611899545434 0 )           
 ( 0.975528258147577 -0.0061857292228732 0 )           
 ( 0.984291580564316 -0.00453051267567372 0 )           
 ( 0.991143625364344 -0.00321039443488459 0 )           
 ( 0.996057350657239 -0.00224956401410408 0 )           
 ( 0.999013364214136 -0.00166580633368094 0 )           
 )               
                
                
 spline 4 17             
 (               
 ( 0.00098663578586422 -0.00635809753497436 0.3 )           
 ( 0.00394264934276106 -0.0122590110626939 0.3 )           
 ( 0.00885637463565564 -0.0176989192334467 0.3 )           
 ( 0.0157084194356845 -0.0226757816331919 0.3 )           
 ( 0.0244717418524232 -0.0271893276626386 0.3 )           
 ( 0.0351117570558743 -0.0312410384885343 0.3 )           
 ( 0.0475864737669902 -0.0348342808580086 0.3 )           
 ( 0.0618466599780682 -0.0380615624096596 0.3 )           
 ( 0.0778360372489925 -0.0410062925925821 0.3 )           
 ( 0.0954915028125263 -0.0436778517447541 0.3 )           
 ( 0.114743378612105 -0.046084227004278 0.3 )           
 ( 0.135515686289294 -0.0482329579663647 0.3 )           
 ( 0.157726447035656 -0.0501316165159494 0.3 )           
 ( 0.181288005125655 -0.0517880584953408 0.3 )           
 ( 0.206107373853763 -0.0531309195162837 0.3 )           
 ( 0.232086602510502 -0.0539891531778003 0.3 )           
 ( 0.259123162949142 -0.0544856203234725 0.3 )           
 ( 0.287110354217464 -0.0547030814940166 0.3 )           
 ( 0.315937723657661 -0.0546936280041581 0.3 )           
 ( 0.345491502812526 -0.0544937153484667 0.3 )           
 ( 0.375655056417573 -0.054130968298588 0.3 )           
 ( 0.406309342707138 -0.0536276477640792 0.3 )           
 ( 0.437333383217848 -0.0530025701951406 0.3 )           
 ( 0.468604740235343 -0.0522722366456904 0.3 )           
 ( 0.5 -0.0514515271670859 0.3 )           
 ( 0.531395259764657 -0.0505541417462108 0.3 )           
 ( 0.562666616782152 -0.0495356239606517 0.3 )           
 ( 0.593690657292862 -0.048262048242063 0.3 )           
 ( 0.624344943582427 -0.0467309001190756 0.3 )           
 ( 0.654508497187474 -0.0449502589402877 0.3 )           
 ( 0.684062276342339 -0.042932612032445 0.3 )           
 ( 0.712889645782536 -0.0406949176004744 0.3 )           
 ( 0.740876837050858 -0.0382585923711643 0.3 )           
 ( 0.767913397489498 -0.0356494146301443 0.3 )           
 ( 0.793892626146236 -0.0328973339264809 0.3 )           
 ( 0.818711994874345 -0.0300361798913442 0.3 )           
 ( 0.842273552964344 -0.0271032644405466 0.3 )           
 ( 0.864484313710706 -0.0241388741908958 0.3 )           
 ( 0.885256621387894 -0.0211856532674638 0.3 )           
 ( 0.904508497187474 -0.0182878808085349 0.3 )           
 ( 0.922163962751008 -0.0154906523075569 0.3 )           
 ( 0.938153340021932 -0.0128389792950405 0.3 )           
 ( 0.95241352623301 -0.010376827483157 0.3 )           
 ( 0.964888242944125 -0.00814611899545434 0.3 )           
 ( 0.975528258147577 -0.0061857292228732 0.3 )           
 ( 0.984291580564316 -0.00453051267567372 0.3 )           
 ( 0.991143625364344 -0.00321039443488459 0.3 )           
 ( 0.996057350657239 -0.00224956401410408 0.3 )           
 ( 0.999013364214136 -0.00166580633368094 0.3 )           
 )               
                
                
);                
                
faces                
(                
                
);                
                
faces                
(                
                    
);                
                
                
defaultPatch                
{                
        name  frontAndBack;                
        type  empty;                
}                
                
boundary                
(                
inlet                            //  patch  name                
                {                
                        type  patch;        //  patch  type  for  patch  0                
                        faces                
                        (                
                                (9  2  6  11)    //  block  face  in  this  patch                
                                (2  3  7  6    )    //  block  face  in  this  patch                
                                (3  12  13  7    )    //  block  face  in  this  patch                
                                (12  15  14  13    )    //  block  face  in  this  patch                
                        );                
                }                  
                
outlet                            //  patch  name                
                {                
                        type  patch;        //  patch  type  for  patch  0                
                        faces                
                        (                
                                (8  9  10  11)    //  block  face  in  this  patch                
                                (15  8  10  14    )    //  block  face  in  this  patch                
                        );                
                }                
                
walls                            //  patch  name                
                {                
                        type  wall;        //  patch  type  for  patch  0                
                        faces                
                        (                
                                (0  1  5  4)    //  block  face  in  this  patch                
                                (0  4  17  16    )    //  block  face  in  this  patch                
                        );                
                }                  
                
interface1                            //  patch  name                
                {                
                        type  patch;        //  patch  type  for  patch  0                
                        faces                
                        (                
                                (1  8  10  5)    //  block  face  in  this  patch                
                        );                
                }                  
interface2                            //  patch  name                
                {                
                        type  patch;        //  patch  type  for  patch  0                
                        faces                
                        (                
                                (16  17  10  8)    //  block  face  in  this  patch                
                        );                
                }                  
);                
                
  mergePatchPairs                
(                
        (  interface1  interface2  )                  
);                
//  *************************************************************************  //                
