openfoam/shape_optimization/clean/baseCase_1/system/forcesIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible (pressure is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/forces/forcesIncompressible.cfg"

rhoInf      1.0;    // Fluid density
patches     (walls);

CofR        (0 0 0);
pitchAxis   (0 0 1);

// ************************************************************************* //
